# SteelElemShearstudTotalWeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemShearstudTotalWeight Property
ParameterTypeId Class See Also
---
"Total Weight"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemShearstudTotalWeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemShearstudTotalWeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemShearstudTotalWeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace